{
  "backend/main.mo": "Defines data models and state for creative profiles, projects, ratings, and collaboration spaces, with authorization checks and CRUD methods like saving/updating profiles.",
  "feature_evidence.json": "Lists implemented features with associated files, components, test IDs, and confidence levels for build verification.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing major frontend components, pages, hooks, and layout behavior for reference.",
  "frontend/index.css": "Sets global Tailwind layers and theme variables for light and dark mode, defining colors, borders, and layout tokens.",
  "frontend/index.html": "Basic HTML entry point that loads the React root element and main TypeScript bundle.",
  "frontend/src/App.tsx": "Configures the TanStack Router, root authentication flow, and route definitions for all app pages.",
  "frontend/src/components/auth/AuthGate.tsx": "Protects authenticated routes by enforcing login and redirecting new users to onboarding while handling profile loading state.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a sign-in/sign-out button using Internet Identity with error handling and React Query cache management.",
  "frontend/src/components/collaboration/MessageBoard.tsx": "Displays a project message board with live loading, message submission, scrolling, and manual refresh controls.",
  "frontend/src/components/collaboration/TaskBoard.tsx": "Displays and manages a task list for a project, allowing adding tasks and refreshing the list.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with navigation, header, footer, and a container for page content.",
  "frontend/src/components/matching/MatchCard.tsx": "Shows a match candidate's info with shared tags and buttons to like or pass.",
  "frontend/src/components/matching/SwipeDeck.tsx": "Cycles through match candidates one at a time and records like/pass decisions.",
  "frontend/src/components/profile/CreativeProfileForm.tsx": "Form for editing a creative profile, including bio, skills, availability, and portfolio links.",
  "frontend/src/components/profile/CreativeProfileView.tsx": "Displays a creative profile with bio, skills, links, and averaged collaboration ratings.",
  "frontend/src/components/projects/ProjectForm.tsx": "Form for creating a new project with title, description, genres, vibes, and goals.",
  "frontend/src/components/system/AccessDeniedScreen.tsx": "Shows an access denied message with a button to return to the dashboard.",
  "frontend/src/components/system/LoadingState.tsx": "Provides loading, empty, and error UI states for various screens.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and exposing login/logout utilities.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for profiles, projects, and mutations such as saving profiles or creating projects.",
  "frontend/src/hooks/useQuizAnswers.ts": "Stores and syncs quiz answers to localStorage and provides completeness checking and reset functionality.",
  "frontend/src/hooks/useSmartMatching.ts": "Generates ranked match candidates from projects based on quiz answers and tracks like/pass decisions in localStorage.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/CollaborationSpacePage.tsx": "Displays a project’s collaboration space with task and message boards, restricting access to the project owner.",
  "frontend/src/pages/DashboardPage.tsx": "Shows user dashboard with profile info, smart matches, project stats, and alerts for incomplete quiz setup.",
  "frontend/src/pages/LandingPage.tsx": "Renders the marketing landing page with hero text, feature highlights, and login buttons.",
  "frontend/src/pages/MatchesPage.tsx": "Shows smart match recommendations after quiz completion, with swipe UI and fallback states.",
  "frontend/src/pages/OnboardingProfileSetupPage.tsx": "Initial profile setup form capturing name and bio, then saving the profile and redirecting to the dashboard.",
  "frontend/src/pages/ProfilePage.tsx": "Displays a user's profile with loading and error states, allowing the owner to edit their information.",
  "frontend/src/pages/ProjectDetailPage.tsx": "Shows detailed project info, genres, goals, and roles, with project completion actions for the owner.",
  "frontend/src/pages/ProjectsPage.tsx": "Lists all projects with search and filtering, plus a dialog to create new projects.",
  "frontend/src/pages/QuizPage.tsx": "Multi-step quiz for selecting skill level, genres, goals, vibes, and inspirations, storing answers for matching.",
  "frontend/src/pages/SettingsPage.tsx": "Renders a settings page displaying quiz completion status and a button linking to the quiz. Uses UI components, hooks, and badges to show and update quiz answers.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, storing/retrieving them in sessionStorage, and managing persisted or hash-based parameters. Includes utilities to clear parameters from session or URL.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, animations, fonts, and container settings. Loads typography, container-queries, and animate plugins.",
  "project_state.json": "JSON describing project metadata, features, requirements, and image needs for the CollabForge app. Tracks project state version and architectural notes."
}